tiborsimon/embedded-tdd-headers/pic/8bit/pic18f46j13_tdd.h
#define DMARCVPTRHB                   522
#define RXADDRL                       523
#define DMARCVPTRLB                   524
#define TXADDRH                       525
#define DMATXPTRHB                    526
#define TXADDRL                       527
#define DMATXPTRLB                    528
#define PMDIN1L                       529
#define PMDIN1L_DATAL                 530
#define PMDIN1H                       531
#define PMDIN1H_DATAH                 532
#define PMADDRL                       533
#define ADDRL                         534
#define PMDOUT1L                      535
#define PMADDRH                       536
#define ADDRH                         537
#define CS1                           538
#define PMDOUT1H                      539
#define CMSTAT                        540
#define COUT1                         541
#define COUT2                         542
#define COUT3                         543
#define SSP2CON2                      544
#define SEN2                          545
#define SSP2CON2_SEN                  546
#define ADMSK12                       547
#define SSP2CON2_RSEN                 548
#define RSEN2                         549
#define SSP2CON2_ADMSK1               550
#define ADMSK22                       551
#define PEN2                          552
#define SSP2CON2_PEN                  553
#define SSP2CON2_ADMSK2               554
#define ADMSK32                       555
#define SSP2CON2_RCEN                 556
#define RCEN2                         557
#define SSP2CON2_ADMSK3               558
#define ACKEN2                        559
#define ADMSK42                       560
#define SSP2CON2_ADMSK4               561
#define SSP2CON2_ACKEN                562
#define ACKDT2                        563
#define ADMSK52                       564
#define SSP2CON2_ACKDT                565
#define SSP2CON2_ADMSK5               566
#define SSP2CON2_ACKSTAT              567
#define ACKSTAT2                      568
#define SSP2CON2_GCEN                 569
#define GCEN2                         570
#define SSP2CON1                      571
#define SSP2CON1_SSPM                 572
#define SSP2CON1_SSPM0                573
#define SSPM02                        574
#define SSPM12                        575
#define SSP2CON1_SSPM1                576
#define SSP2CON1_SSPM2                577
#define SSPM22                        578
#define SSPM32                        579
#define SSP2CON1_SSPM3                580
#define SSP2CON1_CKP                  581
#define CKP2                          582
#define SSPEN2                        583
#define SSP2CON1_SSPEN                584
#define SSPOV2                        585
#define SSP2CON1_SSPOV                586
#define WCOL2                         587
#define SSP2CON1_WCOL                 588
#define SSP2STAT                      589
#define SSP2STAT_BF                   590
#define BF2                           591
#define SSP2STAT_UA                   592
#define UA2                           593
#define RW2                           594
#define READ_WRITE2                   595
#define nW2                           596
#define I2C_READ2                     597
#define SSP2STAT_R_NOT_W              598
#define R_nW2                         599
#define nWRITE2                       600
#define R_W2                          601
#define SSP2STAT_R_nW                 602
#define SSP2STAT_S                    603
#define S2                            604
#define START2                        605
#define I2C_START2                    606
#define P2                            607
#define SSP2STAT_P                    608
#define STOP2                         609
#define I2C_STOP2                     610
#define I2C_DAT2                      611
#define DATA_ADDRESS2                 612
#define SSP2STAT_D_NOT_A              613
#define D_A2                          614
#define SSP2STAT_D_nA                 615
#define nA2                           616
#define DA2                           617
#define nADDRESS2                     618
#define D_nA2                         619
#define SSP2STAT_CKE                  620
#define CKE2                          621
#define SSP2STAT_SMP                  622
#define SMP2                          623
#define SSP2ADD                       624
#define MSK02                         625
#define SSP2ADD_SSPADD                626
#define MSK12                         627
#define MSK22                         628
#define MSK32                         629
#define MSK42                         630
#define MSK52                         631
#define MSK62                         632
#define MSK72                         633
#define SSP2MSK                       634
#define SSP2MSK_MSK0                  635
#define SSP2MSK_MSK1                  636
#define SSP2MSK_MSK2                  637
#define SSP2MSK_MSK3                  638
#define SSP2MSK_MSK4                  639
#define SSP2MSK_MSK5                  640
#define SSP2MSK_MSK6                  641
#define SSP2MSK_MSK7                  642
#define SSP2BUF                       643
#define SSP2BUF_SSPBUF                644
#define T4CON                         645
#define T4CKPS0                       646
#define T4CKPS                        647
#define T4CKPS1                       648
#define TMR4ON                        649
#define T4OUTPS                       650
#define T4OUTPS0                      651
#define T4OUTPS1                      652
#define T4OUTPS2                      653
#define T4OUTPS3                      654
#define PR4                           655
#define TMR4                          656
#define T3CON                         657
#define TMR3ON                        658
#define T3CON_RD16                    659
#define nT3SYNC                       660
#define NOT_T3SYNC                    661
#define SOSCEN3                       662
#define T3OSCEN                       663
#define T3CKPS                        664
#define T3CKPS0                       665
#define T3CKPS1                       666
#define TMR3CS0                       667
#define TMR3CS                        668
#define TMR3CS1                       669
#define T3RD16                        670
#define RD163                         671
#define TMR3L                         672
#define TMR3H                         673
#define BAUDCON2                      674
#define ABDEN2                        675
#define BAUDCON2_ABDEN                676
#define WUE2                          677
#define BAUDCON2_WUE                  678
#define BRG162                        679
#define BAUDCON2_BRG16                680
#define SCKP2                         681
#define TXCKP2                        682
#define BAUDCON2_TXCKP                683
#define DTRXP2                        684
#define RXDTP2                        685
#define BAUDCON2_RXDTP                686
#define RCMT2                         687
#define RCIDL2                        688
#define BAUDCON2_RCIDL                689
#define BAUDCON2_ABDOVF               690
#define ABDOVF2                       691
#define SPBRGH2                       692
#define BAUDCON1                      693
#define BAUDCON1_ABDEN                694
#define ABDEN1                        695
#define BAUDCON1_WUE                  696
#define WUE1                          697
#define W4E                           698
#define BRG161                        699
#define BAUDCON1_BRG16                700
#define CKTXP                         701
#define BAUDCON1_TXCKP                702
#define SCKP1                         703
#define TXCKP1                        704
#define SCKP                          705
#define DTRXP1                        706
#define RXDTP1                        707
#define DTRXP                         708
#define RXCKP                         709
#define BAUDCON1_RXDTP                710
#define RCMT1                         711
#define RCIDL1                        712
#define BAUDCON1_RCIDL                713
#define RCMT                          714
#define ABDOVF1                       715
#define BAUDCON1_ABDOVF               716
#define SPBRGH1                       717
#define PORTA                         718
#define C1INA                         719
#define AN0                           720
#define ULPWUIN                       721
#define ULPWU                         722
#define RP0                           723
#define RA0                           724
#define PMA6                          725
#define VBG                           726
#define PMA7                          727
#define AN1                           728
#define RP1                           729
#define RA1                           730
#define C2INA                         731
#define C1IND                         732
#define AN2                           733
#define C3INB                         734
#define CVREF                         735
#define RA2                           736
#define VREF_MINUS                    737
#define C2INB                         738
#define C1INB                         739
#define AN3                           740
#define VREF_PLUS                     741
#define RA3                           742
#define AN4                           743
#define C1INC                         744
#define NOT_SS1                       745
#define RP2                           746
#define LVDIN                         747
#define RA5                           748
#define nSS1                          749
#define HLVDIN                        750
#define CLKO                          751
#define RA6                           752
#define OSC2                          753
#define CLKI                          754
#define RJPU                          755
#define RA7                           756
#define OSC1                          757
#define PORTB                         758
#define RB0                           759
#define C3IND                         760
#define INT0                          761
#define RP3                           762
#define AN12                          763
#define PMBE                          764
#define RB1                           765
#define C3INC                         766
#define RP4                           767
#define PMPBE                         768
#define RTCC                          769
#define AN10                          770
#define REFO                          771
#define PMA3                          772
#define AN8                           773
#define RB2                           774
#define C2INC                         775
#define RP5                           776
#define CTED1                         777
#define PMA2                          778
#define AN9                           779
#define RB3                           780
#define C3INA                         781
#define CCP2_PA2                      782
#define RP6                           783
#define CTED2                         784
#define PMA1                          785
#define CCP4                          786
#define RB4                           787
#define RP7                           788
#define KBI0                          789
#define PMA0                          790
#define CCP5                          791
#define RB5                           792
#define RP8                           793
#define KBI1                          794
#define CCP6                          795
#define PGC                           796
#define RB6                           797
#define RP9                           798
#define KBI2                          799
#define CCP7                          800
#define PGD                           801
#define RB7                           802
#define RP10                          803
#define KBI3                          804
#define PORTC                         805
#define T1CKI                         806
#define RP11                          807
#define T1OSO                         808
#define RC0                           809
#define CCP8                          810
#define CCP2                          811
#define RP12                          812
#define T1OSI                         813
#define PA2                           814
#define RC1                           815
#define RP13                          816
#define CTPLS                         817
#define PA1                           818
#define RC2                           819
#define C2IND                         820
#define AN11                          821
#define SCK1                          822
#define RP14                          823
#define SCL1                          824
#define RC3                           825
#define SDI1                          826
#define RP15                          827
#define SDA1                          828
#define RC4                           829
#define SDO1                          830
#define RP16                          831
#define RC5                           832
#define PMA5                          833
#define CCP9                          834
#define RP17                          835
#define TX1                           836
#define RC6                           837
#define CK1                           838
#define PMA4                          839
#define RP18                          840
#define RX1                           841
#define PORTC_CCP10                   842
#define RC7                           843
#define DT1                           844
#define PORTD                         845
#define RD0                           846
#define SCL2                          847
#define PMD0                          848
#define RD1                           849
#define SDA2                          850
#define PMD1                          851
#define RD2                           852
#define RP19                          853
#define PMD2                          854
#define RD3                           855
#define PMD3                          856
#define RP20                          857
#define RD4                           858
#define PMD4                          859
#define RP21                          860
#define RD5                           861
#define PMD5                          862
#define RP22                          863
#define RD6                           864
#define PMD6                          865
#define RP23                          866
#define SS2                           867
#define RD7                           868
#define PMD7                          869
#define RP24                          870
#define PORTE                         871
#define PD2                           872
#define RE0                           873
#define PMRD                          874
#define RDE                           875
#define AN5                           876
#define PMPRD                         877
#define WRE                           878
#define PMPWR                         879
#define RE1                           880
#define AN6                           881
#define PMWR                          882
#define PC2                           883
#define PMCS                          884
#define RE2                           885
#define PB2                           886
#define AN7                           887
#define CS                            888
#define PMPCS                         889
#define PORTE_CCP10                   890
#define HLVDCON                       891
#define HLVDL                         892
#define HLVDL0                        893
#define HLVDL1                        894
#define HLVDL2                        895
#define HLVDL3                        896
#define HLVDEN                        897
#define IRVST                         898
#define BGVST                         899
#define VDIRMAG                       900
#define DMACON2                       901
#define INTLVL0                       902
#define INTLVL                        903
#define INTLVL1                       904
#define INTLVL2                       905
#define INTLVL3                       906
#define DLYCYC                        907
#define DLYCYC0                       908
#define DLYCYC1                       909
#define DLYCYC2                       910
#define DLYCYC3                       911
#define OSCCON2                       912
#define PRISD                         913
#define SOSCGO                        914
#define SOSCDRV                       915
#define SOSCRUN                       916
#define DMACON1                       917
#define DMAEN                         918
#define DLYINTEN                      919
#define DUPLEX0                       920
#define DUPLEX1                       921
#define RXINC                         922
#define TXINC                         923
#define SSCON0                        924
#define SSCON1                        925
#define LATA                          926
#define LATA0                         927
#define LA0                           928
#define LATA1                         929
#define LA1                           930
#define LATA2                         931
#define LA2                           932
#define LATA3                         933
#define LA3                           934
#define LATA5                         935
#define LA5                           936
#define LATA6                         937
#define LA6                           938
#define LATA7                         939
#define LA7                           940
#define LATB                          941
#define LB0                           942
#define LATB0                         943
#define LB1                           944
#define LATB1                         945
#define LB2                           946
#define LATB2                         947
#define LB3                           948
#define LATB3                         949
#define LB4                           950
#define LATB4                         951
#define LB5                           952
#define LATB5                         953
#define LB6                           954
#define LATB6                         955
#define LB7                           956
#define LATB7                         957
#define LATC                          958
#define LATC0                         959
#define LC0                           960
#define LATC1                         961
#define LC1                           962
#define LATC2                         963
#define LC2                           964
#define LATC3                         965
#define LC3                           966
#define LATC4                         967
#define LC4                           968
#define LATC5                         969
#define LC5                           970
#define LATC6                         971
#define LC6                           972
#define LATC7                         973
#define LC7                           974
#define LATD                          975
#define LATD0                         976
#define LD0                           977
#define LATD1                         978
#define LD1                           979
#define LATD2                         980
#define LD2                           981
#define LATD3                         982
#define LD3                           983
#define LATD4                         984
#define LD4                           985
#define LATD5                         986
#define LD5                           987
#define LATD6                         988
#define LD6                           989
#define LATD7                         990
#define LD7                           991
#define LATE                          992
#define LATE0                         993
#define LE0                           994
#define LATE1                         995
#define LE1                           996
#define LATE2                         997
#define LE2                           998
#define PIE4                          999
#define CCP3IE                        1000
#define CCP4IE                        1001
#define CCP5IE                        1002
#define CCP6IE                        1003
#define CCP7IE                        1004
#define CCP8IE                        1005
#define CCP9IE                        1006
#define CCP10IE                       1007
#define PIR4                          1008
#define CCP3IF                        1009
#define CCP4IF                        1010
#define CCP5IF                        1011
#define CCP6IF                        1012
#define CCP7IF                        1013
#define CCP8IF                        1014
#define CCP9IF                        1015
#define CCP10IF                       1016
#define IPR4                          1017
#define CCP3IP                        1018
#define CCIP3IP                       1019
#define CCP4IP                        1020
#define CCP5IP                        1021
#define CCP6IP                        1022
#define CCP7IP                        1023
#define CCP8IP                        1024
#define CCP9IP                        1025
#define CCP10IP                       1026
#define PIE5                          1027
#define TMR1GIE                       1028
#define TMR5GIE                       1029
#define TMR5IE                        1030
#define TMR6IE                        1031
#define TMR8IE                        1032
#define CM3IE                         1033
#define TRISA                         1034
#define TRISA0                        1035
#define TRISA1                        1036
#define TRISA2                        1037
#define TRISA3                        1038
#define TRISA5                        1039
#define TRISA6                        1040
#define TRISA7                        1041
#define TRISB                         1042
#define TRISB0                        1043
#define TRISB1                        1044
#define TRISB2                        1045
#define TRISB3                        1046
#define TRISB4                        1047
#define TRISB5                        1048
#define TRISB6                        1049
#define TRISB7                        1050
#define TRISC                         1051
#define TRISC0                        1052
#define TRISC1                        1053
#define TRISC2                        1054
#define TRISC3                        1055
#define TRISC4                        1056
#define TRISC5                        1057
#define TRISC6                        1058
#define TRISC7                        1059
#define TRISD                         1060
#define TRISD0                        1061
#define TRISD1                        1062
#define TRISD2                        1063
#define TRISD3                        1064
#define TRISD4                        1065
#define TRISD5                        1066
#define TRISD6                        1067
#define TRISD7                        1068
#define TRISE                         1069
#define TRISE0                        1070
#define TRISE1                        1071
#define TRISE2                        1072
#define REPU                          1073
#define RDPU                          1074
#define T3GCON                        1075
#define T3GSS0                        1076
#define T3GSS1                        1077
#define T3GVAL                        1078
#define T3GGO                         1079
#define T3DONE                        1080
#define T3GGO_T3DONE                  1081
#define T3GSPM                        1082
#define T3GTM                         1083
#define T3GPOL                        1084
#define TMR3GE                        1085
#define PIR5                          1086
#define TMR1GIF                       1087
#define TMR5GIF                       1088
#define TMR5IF                        1089
#define TMR6IF                        1090
