tiborsimon/embedded-tdd-headers/pic/8bit/pic18f46j13_tdd.h
#define TMR8IF                        1091
#define CM3IF                         1092
#define IPR5                          1093
#define CCH05                         1094
#define TMR1GIP                       1095
#define TMR5GIP                       1096
#define CCH15                         1097
#define TMR5IP                        1098
#define EVPOL05                       1099
#define TMR6IP                        1100
#define EVPOL15                       1101
#define TMR8IP                        1102
#define CM3IP                         1103
#define T1GCON                        1104
#define T1GSS0                        1105
#define T1GSS1                        1106
#define T1GVAL                        1107
#define T1GGO_nT1DONE                 1108
#define T1DONE                        1109
#define nT1DONE                       1110
#define T1GGO_NOT_T1DONE              1111
#define NOT_T1DONE                    1112
#define T1GGO                         1113
#define T1GSPM                        1114
#define T1GTM                         1115
#define T1GPOL                        1116
#define TMR1GE                        1117
#define OSCTUNE                       1118
#define TUN0                          1119
#define TUN                           1120
#define TUN1                          1121
#define TUN2                          1122
#define TUN3                          1123
#define TUN4                          1124
#define TUN5                          1125
#define PLLEN                         1126
#define INTSRC                        1127
#define RCSTA2                        1128
#define RCD82                         1129
#define RX9D2                         1130
#define RCSTA2_RX9D                   1131
#define OERR2                         1132
#define RCSTA2_OERR                   1133
#define FERR2                         1134
#define RCSTA2_FERR                   1135
#define ADDEN2                        1136
#define RCSTA2_ADDEN                  1137
#define RCSTA2_CREN                   1138
#define CREN2                         1139
#define SREN2                         1140
#define RCSTA2_SREN                   1141
#define RC92                          1142
#define RC8_92                        1143
#define RCSTA2_RX9                    1144
#define RX92                          1145
#define RCSTA2_SPEN                   1146
#define SPEN2                         1147
#define PIE1                          1148
#define TMR1IE                        1149
#define TMR2IE                        1150
#define CCP1IE                        1151
#define SSP1IE                        1152
#define SSPIE                         1153
#define TXIE                          1154
#define TX1IE                         1155
#define RC1IE                         1156
#define RCIE                          1157
#define ADIE                          1158
#define PSPIE                         1159
#define PMPIE                         1160
#define PIR1                          1161
#define TMR1IF                        1162
#define TMR2IF                        1163
#define CCP1IF                        1164
#define SSPIF                         1165
#define SSP1IF                        1166
#define TXIF                          1167
#define TX1IF                         1168
#define RCIF                          1169
#define RC1IF                         1170
#define ADIF                          1171
#define PSPIF                         1172
#define PMPIF                         1173
#define IPR1                          1174
#define TMR1IP                        1175
#define TMR2IP                        1176
#define CCP1IP                        1177
#define SSPIP                         1178
#define SSP1IP                        1179
#define TX1IP                         1180
#define TXIP                          1181
#define RCIP                          1182
#define RC1IP                         1183
#define ADIP                          1184
#define PMPIP                         1185
#define PSPIP                         1186
#define PIE2                          1187
#define CCP2IE                        1188
#define TMR3IE                        1189
#define HLVDIE                        1190
#define LVDIE                         1191
#define BCL1IE                        1192
#define BCLIE                         1193
#define CM1IE                         1194
#define CMIE                          1195
#define CM2IE                         1196
#define OSCFIE                        1197
#define PIR2                          1198
#define CCP2IF                        1199
#define TMR3IF                        1200
#define HLVDIF                        1201
#define LVDIF                         1202
#define BCL1IF                        1203
#define BCLIF                         1204
#define CM1IF                         1205
#define CMIF                          1206
#define CM2IF                         1207
#define OSCFIF                        1208
#define IPR2                          1209
#define CCP2IP                        1210
#define TMR3IP                        1211
#define HLVDIP                        1212
#define LVDIP                         1213
#define BCLIP                         1214
#define BCL1IP                        1215
#define CM1IP                         1216
#define CM2IP                         1217
#define CMIP                          1218
#define OSCFIP                        1219
#define PIE3                          1220
#define RTCCIE                        1221
#define RXB0IE                        1222
#define RXBNIE                        1223
#define TMR3GIE                       1224
#define RXB1IE                        1225
#define CTMUIE                        1226
#define TXB0IE                        1227
#define TMR4IE                        1228
#define TXB1IE                        1229
#define TXB2IE                        1230
#define TXBNIE                        1231
#define TX2IE                         1232
#define RC2IE                         1233
#define BCL2IE                        1234
#define SSP2IE                        1235
#define PIR3                          1236
#define RTCCIF                        1237
#define RXBNIF                        1238
#define TMR3GIF                       1239
#define CTMUIF                        1240
#define TMR4IF                        1241
#define TXBNIF                        1242
#define TX2IF                         1243
#define RC2IF                         1244
#define BCL2IF                        1245
#define SSP2IF                        1246
#define IPR3                          1247
#define RTCCIP                        1248
#define TMR3GIP                       1249
#define RXBNIP                        1250
#define CTMUIP                        1251
#define TMR4IP                        1252
#define TX2IP                         1253
#define TXBNIP                        1254
#define RC2IP                         1255
#define BCL2IP                        1256
#define SSP2IP                        1257
#define EECON1                        1258
#define WR                            1259
#define WREN                          1260
#define WRERR                         1261
#define FREE                          1262
#define WPROG                         1263
#define EECON2                        1264
#define TXSTA2                        1265
#define TX9D2                         1266
#define TXSTA2_TX9D                   1267
#define TXD82                         1268
#define TRMT2                         1269
#define TXSTA2_TRMT                   1270
#define BRGH2                         1271
#define TXSTA2_BRGH                   1272
#define SENDB2                        1273
#define TXSTA2_SENDB                  1274
#define TXSTA2_SYNC                   1275
#define SYNC2                         1276
#define TXEN2                         1277
#define TXSTA2_TXEN                   1278
#define TX8_92                        1279
#define TX92                          1280
#define TXSTA2_TX9                    1281
#define TXSTA2_CSRC                   1282
#define CSRC2                         1283
#define TXREG2                        1284
#define RCREG2                        1285
#define SPBRG2                        1286
#define RCSTA1                        1287
#define RCSTA1_RX9D                   1288
#define RX9D1                         1289
#define RCD8                          1290
#define RCSTA1_OERR                   1291
#define OERR1                         1292
#define RCSTA1_FERR                   1293
#define FERR1                         1294
#define RCSTA1_ADDEN                  1295
#define ADDEN1                        1296
#define ADEN                          1297
#define RCSTA1_CREN                   1298
#define CREN1                         1299
#define SRENA                         1300
#define SREN1                         1301
#define RCSTA1_SREN                   1302
#define RC8_9                         1303
#define RCSTA1_RX9                    1304
#define nRC8                          1305
#define NOT_RC8                       1306
#define RC9                           1307
#define RX91                          1308
#define RCSTA1_SPEN                   1309
#define SPEN1                         1310
#define TXSTA1                        1311
#define TX9D1                         1312
#define TXSTA1_TX9D                   1313
#define TXD8                          1314
#define TRMT1                         1315
#define TXSTA1_TRMT                   1316
#define BRGH1                         1317
#define TXSTA1_BRGH                   1318
#define TXSTA1_SENDB                  1319
#define SENDB1                        1320
#define TXSTA1_SYNC                   1321
#define SYNC1                         1322
#define TXEN1                         1323
#define TXSTA1_TXEN                   1324
#define TX91                          1325
#define TX8_9                         1326
#define NOT_TX8                       1327
#define nTX8                          1328
#define TXSTA1_TX9                    1329
#define TXSTA1_CSRC                   1330
#define CSRC1                         1331
#define TXREG1                        1332
#define RCREG1                        1333
#define SPBRG1                        1334
#define CTMUICON                      1335
#define IRNG                          1336
#define IRNG0                         1337
#define IRNG1                         1338
#define ITRIM0                        1339
#define ITRIM                         1340
#define ITRIM1                        1341
#define ITRIM2                        1342
#define ITRIM3                        1343
#define ITRIM4                        1344
#define ITRIM5                        1345
#define CTMUCONL                      1346
#define EDG1STAT                      1347
#define EDG2STAT                      1348
#define EDG1SEL0                      1349
#define EDG1SEL1                      1350
#define EDG1POL                       1351
#define EDG2SEL0                      1352
#define EDG2SEL1                      1353
#define EDG2POL                       1354
#define CTMUCONH                      1355
#define CTTRIG                        1356
#define IDISSEN                       1357
#define EDGSEQEN                      1358
#define EDGEN                         1359
#define TGEN                          1360
#define CTMUSIDL                      1361
#define CTMUEN                        1362
#define CCP2CON                       1363
#define CCP2M                         1364
#define CCP2M0                        1365
#define CCP2M1                        1366
#define CCP2M2                        1367
#define CCP2M3                        1368
#define DC2B                          1369
#define DC2B0                         1370
#define CCP2Y                         1371
#define DC2B1                         1372
#define CCP2X                         1373
#define P2M                           1374
#define P2M0                          1375
#define P2M1                          1376
#define CCPR2L                        1377
#define CCPR2H                        1378
#define ECCP2DEL                      1379
#define ECCP2DEL_P2DC0                1380
#define P2DC                          1381
#define ECCP2DEL_P2DC1                1382
#define ECCP2DEL_P2DC2                1383
#define ECCP2DEL_P2DC3                1384
#define ECCP2DEL_P2DC4                1385
#define ECCP2DEL_P2DC5                1386
#define ECCP2DEL_P2DC6                1387
#define P2RSEN                        1388
#define PSS2BD                        1389
#define PSS2BD0                       1390
#define PSS2BD1                       1391
#define PSS2AC0                       1392
#define PSS2AC                        1393
#define PSS2AC1                       1394
#define ECCP2AS0                      1395
#define ECCP2AS                       1396
#define ECCP2AS1                      1397
#define ECCP2AS2                      1398
#define ECCP2ASE                      1399
#define PSTR2CON                      1400
#define PSTR2CON_STRA                 1401
#define P2DC02                        1402
#define STRA2                         1403
#define P2DC0CON                      1404
#define PSTR2CON_P2DC0                1405
#define STRB2                         1406
#define P2DC12                        1407
#define PSTR2CON_STRB                 1408
#define PSTR2CON_P2DC1                1409
#define P2DC1CON                      1410
#define PSTR2CON_STRC                 1411
#define STRC2                         1412
#define PSTR2CON_P2DC2                1413
#define P2DC22                        1414
#define P2DC2CON                      1415
#define P2DC32                        1416
#define STRD2                         1417
#define PSTR2CON_STRD                 1418
#define P2DC3CON                      1419
#define PSTR2CON_P2DC3                1420
#define P2DC4CON                      1421
#define STRSYNC2                      1422
#define PSTR2CON_STRSYNC              1423
#define PSTR2CON_P2DC4                1424
#define P2DC42                        1425
#define P2DC52                        1426
#define P2DC5CON                      1427
#define PSTR2CON_P2DC5                1428
#define P2DC6CON                      1429
#define CMPL02                        1430
#define PSTR2CON_P2DC6                1431
#define P2DC62                        1432
#define PSTR2CON_CMPL0                1433
#define CMPL12                        1434
#define PSTR2CON_CMPL1                1435
#define CCP1CON                       1436
#define CCP1M0                        1437
#define CCP1M                         1438
#define CCP1M1                        1439
#define CCP1M2                        1440
#define CCP1M3                        1441
#define CCP1Y                         1442
#define DC1B                          1443
#define DC1B0                         1444
#define CCP1X                         1445
#define DC1B1                         1446
#define P1M                           1447
#define P1M0                          1448
#define P1M1                          1449
#define CCPR1L                        1450
#define CCPR1H                        1451
#define ECCP1DEL                      1452
#define P1DC                          1453
#define P1DC0                         1454
#define P1DC1                         1455
#define P1DC2                         1456
#define P1DC3                         1457
#define P1DC4                         1458
#define P1DC5                         1459
#define P1DC6                         1460
#define P1RSEN                        1461
#define PSS1BD0                       1462
#define PSS1BD                        1463
#define PSS1BD1                       1464
#define PSS1AC                        1465
#define PSS1AC0                       1466
#define PSS1AC1                       1467
#define ECCP1AS                       1468
#define ECCP1AS0                      1469
#define ECCP1AS1                      1470
#define ECCP1AS2                      1471
#define ECCP1ASE                      1472
#define PSTR1CON                      1473
#define PSTR1CON_STRA                 1474
#define PSTR1CON_STRB                 1475
#define PSTR1CON_STRC                 1476
#define PSTR1CON_STRD                 1477
#define PSTR1CON_STRSYNC              1478
#define PSTR1CON_CMPL0                1479
#define PSTR1CON_CMPL1                1480
#define WDTCON                        1481
#define SWDTEN                        1482
#define SWDTE                         1483
#define ULPSINK                       1484
#define ULPEN                         1485
#define DS                            1486
#define VBGOE                         1487
#define ULPLVL                        1488
#define LVDSTAT                       1489
#define REGSLP                        1490
#define ADCON1                        1491
#define ADCS0                         1492
#define ADCS                          1493
#define ADCS1                         1494
#define ADCS2                         1495
#define ACQT0                         1496
#define ACQT                          1497
#define CHSN3                         1498
#define ACQT1                         1499
#define VCFG01                        1500
#define ACQT2                         1501
#define VCFG11                        1502
#define ADCON1_ADCAL                  1503
#define ADFM                          1504
#define ADCON0                        1505
#define ADON                          1506
#define nDONE                         1507
#define GO_nDONE                      1508
#define NOT_DONE                      1509
#define GODONE                        1510
#define GO_DONE                       1511
#define DONE                          1512
#define GO                            1513
#define GO_NOT_DONE                   1514
#define CHS                           1515
#define CHS0                          1516
#define CHS1                          1517
#define CHS2                          1518
#define CHS3                          1519
#define VCFG                          1520
#define VCFG0                         1521
#define VCFG1                         1522
#define ADCON0_ADCAL                  1523
#define ADRESL                        1524
#define ADRESH                        1525
#define SSP1CON2                      1526
#define SEN1                          1527
#define SSP1CON2_SEN                  1528
#define ADMSK11                       1529
#define SSP1CON2_RSEN                 1530
#define RSEN1                         1531
#define SSP1CON2_ADMSK1               1532
#define SSP1CON2_PEN                  1533
#define ADMSK21                       1534
#define PEN1                          1535
#define SSP1CON2_ADMSK2               1536
#define ADMSK31                       1537
#define RCEN1                         1538
#define SSP1CON2_RCEN                 1539
#define SSP1CON2_ADMSK3               1540
#define SSP1CON2_ACKEN                1541
#define ACKEN1                        1542
#define ADMSK41                       1543
#define SSP1CON2_ADMSK4               1544
#define ACKDT1                        1545
#define ADMSK51                       1546
#define SSP1CON2_ACKDT                1547
#define SSP1CON2_ADMSK5               1548
#define SSP1CON2_ACKSTAT              1549
#define ACKSTAT1                      1550
#define GCEN1                         1551
#define SSP1CON2_GCEN                 1552
#define SSP1CON1                      1553
#define SSP1CON1_SSPM0                1554
#define SSPM01                        1555
#define SSP1CON1_SSPM                 1556
#define SSP1CON1_SSPM1                1557
#define SSPM11                        1558
#define SSP1CON1_SSPM2                1559
#define SSPM21                        1560
#define SSPM31                        1561
#define SSP1CON1_SSPM3                1562
#define SSP1CON1_CKP                  1563
#define CKP1                          1564
#define SSPEN1                        1565
#define SSP1CON1_SSPEN                1566
#define SSPOV1                        1567
#define SSP1CON1_SSPOV                1568
#define WCOL1                         1569
#define SSP1CON1_WCOL                 1570
#define SSP1STAT                      1571
#define BF1                           1572
#define SSP1STAT_BF                   1573
#define SSP1STAT_UA                   1574
#define UA1                           1575
#define SSP1STAT_R_NOT_W              1576
#define READ_WRITE                    1577
#define RW1                           1578
#define NOT_W                         1579
#define I2C_READ                      1580
#define nW                            1581
#define RW                            1582
#define nWRITE                        1583
#define R                             1584
#define NOT_WRITE                     1585
#define R_W                           1586
#define SSP1STAT_R_nW                 1587
#define SSP1STAT_S                    1588
#define START                         1589
#define START1                        1590
#define I2C_START                     1591
#define STOP                          1592
#define SSP1STAT_P                    1593
#define STOP1                         1594
#define I2C_STOP                      1595
#define SSP1STAT_D_NOT_A              1596
#define NOT_A                         1597
#define SSP1STAT_D_nA                 1598
#define nA                            1599
#define D_A                           1600
#define D                             1601
#define DA1                           1602
#define DA                            1603
#define DATA_ADDRESS                  1604
#define NOT_ADDRESS                   1605
#define nADDRESS                      1606
#define I2C_DAT                       1607
#define SSP1STAT_CKE                  1608
#define CKE1                          1609
#define SSP1STAT_SMP                  1610
#define SMP1                          1611
#define SSP1ADD                       1612
#define SSP1ADD_SSPADD                1613
#define SSP1ADD_MSK0                  1614
#define MSK01                         1615
#define SSP1ADD_MSK1                  1616
#define MSK11                         1617
#define SSP1ADD_MSK2                  1618
#define MSK21                         1619
#define MSK31                         1620
#define SSP1ADD_MSK3                  1621
#define SSP1ADD_MSK4                  1622
#define MSK41                         1623
#define MSK51                         1624
#define SSP1ADD_MSK5                  1625
#define SSP1ADD_MSK6                  1626
#define MSK61                         1627
#define MSK71                         1628
#define SSP1ADD_MSK7                  1629
#define SSP1MSK                       1630
#define SSP1MSK_MSK0                  1631
#define SSP1MSK_MSK1                  1632
#define SSP1MSK_MSK2                  1633
#define SSP1MSK_MSK3                  1634
#define SSP1MSK_MSK4                  1635
#define SSP1MSK_MSK5                  1636
#define SSP1MSK_MSK6                  1637
#define SSP1MSK_MSK7                  1638
#define SSP1BUF                       1639
#define SSP1BUF_SSPBUF                1640
#define T2CON                         1641
#define T2CKPS0                       1642
#define T2CKPS                        1643
#define T2CKPS1                       1644
#define TMR2ON                        1645
#define T2OUTPS0                      1646
#define T2OUTPS                       1647
#define T2OUTPS1                      1648
